---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ElementHasFlowCalculation
source: html/18e44b11-889c-6566-c029-f2281f76e8f5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ElementHasFlowCalculation Property

This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementHasFlowCalculation { get; }
```